Информационная_база_5/src/Documents/ВКМ_ОбслуживаниеКлинента/ВКМ_ОбслуживаниеКлинента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлинента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблеммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыпоненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база_5/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база_5/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база_5/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база_5/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Информационная_база_5/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_По</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Информационная_база_5/src/Documents/ВКМ_ОбслуживаниеКлинента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлинента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлинента.ДатаПроведенияРабот КАК Дата,
		|	ВКМ_ОбслуживаниеКлинента.ВремяНачалаРабот КАК Время,
		|	ВКМ_ОбслуживаниеКлинента.Ссылка КАК Ссылка,
		|	ВКМ_ОбслуживаниеКлинента.Специалист КАК Сотрудник,
		|	ВКМ_ОбслуживаниеКлинента.ВыпоненныеРаботы.(
		|		ОписаниеРабот КАК ОписаниеРабот
		|	) КАК ВыпоненныеРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлинента КАК ВКМ_ОбслуживаниеКлинента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлинента.Ссылка = &Ссылка";
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();  
	Выборка.Следующий();
	
	ТекстТелеграм = СтрШаблон("Создан Новый документ: Клиент %1, Дата проведения работ %2  Время начало работ %3  Сотрудник %4, Описание проблеммы;%5", 
								Клиент, Формат(ДатаПроведенияРабот,"ДЛФ=DD;" ), Формат(ВремяНачалаРабот,"ДЛФ=T;"), Специалист, ОписаниеПроблеммы);	
	
	Если ЭтоНовый() Тогда	
		СоздатьУведомление(ТекстТелеграм);
	ИначеЕсли Не ЭтоНовый() Тогда
		Если Выборка.Сотрудник <> Специалист Тогда
			НовыйСпециалист = Специалист;
		КонецЕсли;
		Если Выборка.Дата <> ДатаПроведенияРабот Тогда
			НоваяДата = Формат(ДатаПроведенияРабот,"ДЛФ=DD;" );
		КонецЕсли;
		Если Выборка.Время <> ВремяНачалаРабот Тогда
			НовоеВремя = Формат(ВремяНачалаРабот,"ДЛФ=T;");
		КонецЕсли;
		Если Выборка.Клиент <> Клиент Тогда
			НовыйКлиент = Клиент;
		КонецЕсли;
		ТекстТелеграм = СтрШаблон("Изменен документ %1: Клиент %2, Дата проведения работ %3 Время начало работ %4 Сотрудник %5, Описание проблеммы;%6",
									Ссылка, НовыйКлиент, НоваяДата, НовоеВремя, НовыйСпециалист, ОписаниеПроблеммы);	
		СоздатьУведомление(ТекстТелеграм);
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)      
	
// Движение пот регистру ВыполненныеКлиентуРаботы.	

 Запрос = Новый Запрос;
 Запрос.Текст =
 	"ВЫБРАТЬ
 	|	ДоговорыКонтрагентов.Владелец КАК Клиент,
 	|	ДоговорыКонтрагентов.ВКМ_ПериодС КАК От,
 	|	ДоговорыКонтрагентов.ВКМ_По КАК До,
 	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ЦенаЧас,
 	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
 	|ИЗ
 	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
 	|ГДЕ
 	|	ДоговорыКонтрагентов.Владелец = &Владелец";
 
 Запрос.УстановитьПараметр("Владелец", Клиент);
 
 РезультатЗапроса = Запрос.Выполнить();
 
 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
 
 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 	
 	Если ВыборкаДетальныеЗаписи.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")
 	                 И  ВыборкаДетальныеЗаписи.От <= ДатаПроведенияРабот 
 	                     И ВыборкаДетальныеЗаписи.До >= ДатаПроведенияРабот Тогда 
 	                     	
 	     	Для Каждого ТекСтрока из ВыпоненныеРаботы Цикл
 	   		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = ТекСтрока.ФактическоПотраченоЧасов;
			СуммаОплаты = ВыборкаДетальныеЗаписи.ЦенаЧас * ТекСтрока.ФактическоПотраченоЧасов;
			Движение.СуммаКОплате = СуммаОплаты;
			
		КонецЦикла;	
	КонецЕсли;
 	
КонецЦикла;    

// Движение по регистру ВКМ_ВыполненныеСотрудникомРаботы

 Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;  
		Сообщить("Отсутствует значение процента от работы для указанного специалиста!"); 
		Возврат; 
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	//регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина; 
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить(); 
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
	Движение.Период = Дата; 
	Движение.Сотрудник = Специалист; 
	Движение.ЧасовКОплате = ВыпоненныеРаботы.Итог("ЧасыКОплате"); 
	
	ЧасовКОплатеКлиенту = ВыпоненныеРаботы.Итог("ЧасыКОплате");   
	СтавкаЧасаКлиента = Договор.ВКМ_СтоимостьЧасаРаботы; 
	ПроцентОтРабот = ВыборкаДетальныеЗаписи.ПроцентОтРабот; 
    
    Движение.СуммаКОплате = ЧасовКОплатеКлиенту * СтавкаЧасаКлиента * ПроцентОтРабот / 100; 
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать(); 


 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьУведомление(ТекстТелеграм) 
	
	НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент(); 
	НовыйЭлемент.Текст = ТекстТелеграм; 
	НовыйЭлемент.Записать();    
	
КонецПроцедуры


#КонецОбласти
#КонецЕсли
